src/Catalogs/СегментыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СегментыСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/УпрощеннаяНастройкаСхемыКомпоновкиДанных/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяСправочникаДляМакета = Неопределено;
	// Переданный в параметре адрес сохраняется в качестве адреса исходной схемы
	АдресИсходнойСхемыКомпоновкиДанных = Параметры.АдресСхемыКомпоновкиДанных;
	АдресСхемыКомпоновкиДанныхНастройки = Параметры.АдресСхемыКомпоновкиДанныхНастройки;

	// Заголовок формы
	Заголовок = Параметры.Заголовок;
	
	// Заполнение списка шаблонов
	ИсточникШаблоновОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Параметры.ИсточникШаблонов));
	
	Для каждого Макет из ИсточникШаблоновОбъектМетаданных.Макеты Цикл
		
		Если Макет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.СхемаКомпоновкиДанных Тогда
			
			СписокШаблонов.Добавить(Новый Структура("ПолноеИмяОбъекта, ИмяМакета", ИсточникШаблоновОбъектМетаданных.ПолноеИмя(), Макет.Имя), Макет.Синоним);
			ИмяСправочникаДляМакета = ИсточникШаблоновОбъектМетаданных.ПолноеИмя();
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Исходная схема компоновки данных копируется в редактируемую схему компоновки данных
	СкопироватьСхемуКомпоновкиДанных(АдресРедактируемойСхемыКомпоновкиДанных, АдресИсходнойСхемыКомпоновкиДанных);
	
	// Компоновщик настроек инициализируется редактируемой схемой компоновки данных
	ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресРедактируемойСхемыКомпоновкиДанных, АдресСхемыКомпоновкиДанныхНастройки, ИмяСправочникаДляМакета);
	
	ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресРедактируемойСхемыКомпоновкиДанных);       // Для сохранения временной настройки при открытии окна настройки повторно
	УстановитьСхемуКомпоновкиДанных(АдресИсходнойСхемыКомпоновкиДанных, АдресРедактируемойСхемыКомпоновкиДанных); // М*
	
	Если Элементы.КомпоновщикНастроекНастройкиОтбор.ПодчиненныеЭлементы.Найти("КомпоновщикНастроекНастройкиОтборГруппаКолонок") <> Неопределено Тогда 	
		Элементы.КомпоновщикНастроекНастройкиОтбор.ПодчиненныеЭлементы.КомпоновщикНастроекНастройкиОтборГруппаКолонок.ПодчиненныеЭлементы.КомпоновщикНастроекНастройкиОтборГруппаКолонок2.ПодчиненныеЭлементы.КомпоновщикНастроекНастройкиОтборГруппаКолонок4.ПодчиненныеЭлементы.КомпоновщикНастроекНастройкиОтборПравоеЗначение.УстановитьДействие("НачалоВыбора", "ОткрытьФормуВыбораРеквизита");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда		
		
		// Получена схема из конструктора схемы компоновки данных
		Модифицированность = Истина;
		РедактируемаяСхемаКомпоновкиДанныхМодифицированность = Истина;
		
		// Редактируемая схема компоновки данных замещается схемой, полученной из конструктора
		УстановитьСхемуКомпоновкиДанных(АдресРедактируемойСхемыКомпоновкиДанных, ВыбранноеЗначение);
		
		// Компоновщик настроек инициализируется редактируемой схемой
		ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресРедактируемойСхемыКомпоновкиДанных, АдресСхемыКомпоновкиДанныхНастройки);
		
	#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если РедактируемаяСхемаКомпоновкиДанныхМодифицированность Тогда
		
		// Настройки компоновщика настроек помещаются в редактируемую схему
		ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресРедактируемойСхемыКомпоновкиДанных);
		
		// Исходная схема замещается редактируемой схемой
		УстановитьСхемуКомпоновкиДанных(АдресИсходнойСхемыКомпоновкиДанных, АдресРедактируемойСхемыКомпоновкиДанных);
		
	Иначе
		
		// Настройки компоновщика настроек помещаются в исходную схему
		ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресИсходнойСхемыКомпоновкиДанных);
	
	КонецЕсли;

	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьШаблон(Команда)

	СписокШаблонов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыбратьШаблонПослеВыбора", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьШаблонПослеВыбора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		ТекстВопроса = НСтр("ru='Текущие настройки будут потеряны. Продолжить?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьШаблонЗавершение", ЭтотОбъект, Новый Структура("ВыбранныйШаблон", ВыбранныйЭлемент)), ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьШаблонЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбранныйШаблон = ДополнительныеПараметры.ВыбранныйШаблон;

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗагрузитьИзМакета(ВыбранныйШаблон.Значение.ПолноеИмяОбъекта, ВыбранныйШаблон.Значение.ИмяМакета, КомпоновщикНастроек, АдресРедактируемойСхемыКомпоновкиДанных, АдресРедактируемойСхемыКомпоновкиДанных);
		Модифицированность = Истина;
		РедактируемаяСхемаКомпоновкиДанныхМодифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСхемуКомпоновки(Команда)
	
	ОткрытьКонструкторСхемыКомпоновкиДанных();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура ОткрытьКонструкторСхемыКомпоновкиДанных()
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		// Настройки компоновщика настроек помещаются в редактируемую схему
		ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресРедактируемойСхемыКомпоновкиДанных);
		
		// Создается копия редактируемой схемы
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресРедактируемойСхемыКомпоновкиДанных)));
		
		// Копия редактируемой схемы открывается в конструкторе
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		ПоказатьПредупреждение(,НСтр("ru='Для того, чтобы редактировать схему компоновки, необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСхемуКомпоновкиДанных(АдресПриемник, АдресСхемаИсточник)
	
	Если ЭтоАдресВременногоХранилища(АдресСхемаИсточник) Тогда
		
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемаИсточник);
		
	Иначе
		
		СхемаКомпоновкиДанных = АдресСхемаИсточник;
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресПриемник) Тогда
		
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресПриемник);
		
	Иначе
		
		АдресПриемник = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СкопироватьСхемуКомпоновкиДанных(АдресПриемник, АдресИсточник)
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресИсточник);
	
	Если ТипЗнч(СхемаКомпоновкиДанных) = Тип("СхемаКомпоновкиДанных") Тогда
		
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(СхемаКомпоновкиДанных));
		
	Иначе
		
		СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресПриемник) Тогда
		
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресПриемник);
		
	Иначе
		
		АдресПриемник = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных, АдресСхемыКомпоновкиДанныхНастр, ИмяСправочника = Неопределено)
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	СхемаКомпоновкиДанныхНастройки = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанныхНастр);
	
	Попытка
		
		// При обновлении со старой стомы на новую возникает проблема при открытии правил, элемент списка слева оказывается не заполненным.
		// Подставляем общую схему, далее все настройки пользовательского отбора сохраняются. 		
		Если ИмяСправочника = "Справочник.СегментыНоменклатуры" Тогда
			СКД = Справочники.СегментыНоменклатуры.ПолучитьМакет("ОсновнаяСхема");
		ИначеЕсли ИмяСправочника = "Справочник.СегментыСотрудников"	Тогда         
			СКД = Справочники.СегментыСотрудников.ПолучитьМакет("ОсновнаяСхема"); 		
		ИначеЕсли ИмяСправочника = "Справочник.СегментыКонтрагентов" Тогда              
			СКД = Справочники.СегментыКонтрагентов.ПолучитьМакет("ОсновнаяСхема");
		КонецЕсли;   	
		
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор());
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
		
		Если СхемаКомпоновкиДанныхНастройки = Неопределено Тогда
			СхемаКомпоновкиДанныхНастройки = СКД;		
		КонецЕсли;
		
	Исключение
		
	КонецПопытки;	 	
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанныхНастройки.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных)

	КомпоновщикНастроек.Восстановить();
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

	ОбщегоНазначенияКлиентСерверСтоматология.ОчиститьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	ОбщегоНазначенияКлиентСерверСтоматология.СкопироватьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, КомпоновщикНастроек.ПолучитьНастройки());

	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных);

КонецПроцедуры

&НаСервере
// БезКонтекста
Процедура ЗагрузитьИзМакета(ПолноеИмяОбъекта, ИмяМакета, КомпоновщикНастроек, АдресСхемыКомпоновкиДанных, АдресСхемыКомпоновкиДанныхСохр)
	
	// ПоместитьВоВременноеХранилище(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта).ПолучитьМакет(ИмяМакета), АдресСхемыКомпоновкиДанных);
	
	// М* Дополним запрос СКД доп.реквизитами
	
	СКД = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта).ПолучитьМакет(ИмяМакета);
	
	Если ПолноеИмяОбъекта = "Справочник.СегментыКонтрагентов" Тогда
		// ЗапросСкд = СКД.НаборыДанных.СписокСегмента.Запрос;	
		// СтруктураСкд = ДополнитьЗапросСКДКонтрагенты(ЗапросСкд);
		Если НЕ СКД.Параметры.Найти("СтруктурнаяЕдиница") = Неопределено Тогда 
			СКД.Параметры.СтруктурнаяЕдиница.Значение = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		КонецЕсли;	
	ИначеЕсли ПолноеИмяОбъекта = "Справочник.СегментыНоменклатуры" Тогда
		// ЗапросСкд = СКД.НаборыДанных.СписокСегмента.Запрос;	
		// СтруктураСкд = ДополнитьЗапросСКДНоменклатура(ЗапросСкд);
	Иначе	
		ПоместитьВоВременноеХранилище(СКД, АдресСхемыКомпоновкиДанных);	
		ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных, АдресСхемыКомпоновкиДанныхСохр);
		Возврат;
	КонецЕсли;	
		
	//// ЗапросСкд = СКД.НаборыДанных.СписокСегмента.Запрос;	
	//// СтруктураСкд = ДополнитьЗапросСКД(ЗапросСкд);
	// ЗапросСКД = СтруктураСкд.ЗапросСкд;
	// ПараметрыСкд = СтруктураСкд.ПараметрыСкд;
	//
	// Для Каждого Параметр Из ПараметрыСкд Цикл
	//	
	//	ПараметрСКД = СКД.Параметры.Добавить();
	//	ПараметрСКД.Имя = Параметр.Представление;
	//	ПараметрСКД.Заголовок = Параметр.Представление;
	//	ПараметрСКД.Значение = Параметр.Значение;
	//	ПараметрСКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	//	ПараметрСКД.ОграничениеИспользования = Истина;
	//	ПараметрСКД.ВключатьВДоступныеПоля = Ложь;
	//	
	//	ПолеДопРеквизиты = СКД.НаборыДанных.СписокСегмента.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных")); 
	//	ПолеДопРеквизиты.Поле = СтрЗаменить(Параметр.Значение, " ", "");
	//	ПолеДопРеквизиты.ПутьКДанным = "ДопРеквизиты."+СтрЗаменить(Параметр.Значение, " ", "");		
	//	ПолеДопРеквизиты.ОграничениеИспользования.Поле = Истина;
	//	ПолеДопРеквизиты.ОграничениеИспользования.Порядок = Истина;
	//	ПолеДопРеквизиты.ОграничениеИспользованияРеквизитов.Поле = Истина;
	//	ПолеДопРеквизиты.ОграничениеИспользованияРеквизитов.Группировка = Истина;
	//	ПолеДопРеквизиты.ОграничениеИспользованияРеквизитов.Порядок = Истина;
	//	ПолеДопРеквизиты.ОграничениеИспользованияРеквизитов.Условие = Истина;
	//	
	//	ПолеДопРеквизиты.ТипЗначения = Параметр.Значение.ТипЗначения;
	//	
	// КонецЦикла;
	//	
	// Если ПараметрыСкд.Количество() > 0 Тогда
	//	ГруппДопРеквизиты = СКД.НаборыДанных.СписокСегмента.Поля.Добавить(Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных")); 
	//	ГруппДопРеквизиты.Заголовок = "Доп.реквизиты";
	//	ГруппДопРеквизиты.ПутьКДанным = "ДопРеквизиты";
	//	ГруппДопРеквизиты.ОграничениеИспользования.Поле = Истина;
	//	ГруппДопРеквизиты.ОграничениеИспользования.Группировка = Истина;
	//	ГруппДопРеквизиты.ОграничениеИспользования.Порядок = Истина;
	//	СКД.НаборыДанных.СписокСегмента.Запрос = ЗапросСкд;	
	// КонецЕсли;	                                             
		
	ПоместитьВоВременноеХранилище(СКД, АдресСхемыКомпоновкиДанных);	
	
	// М*
	
	ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных, АдресСхемыКомпоновкиДанныхСохр);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// СтандартнаяОбработка = Ложь;
	
	Элемент = Элементы.КомпоновщикНастроекНастройкиОтбор;
	
	ТекСтрока = Элемент.ТекущиеДанные;
	ТекПоле = Элемент.ТекущийЭлемент;
	ВыбПоле = ТекСтрока.ЛевоеЗначение;
	
	Если ТекПоле.Имя = "КомпоновщикНастроекНастройкиОтборПравоеЗначение" И Лев(Строка(ВыбПоле), 12) = "ДопРеквизиты" Тогда
		СтандартнаяОбработка = Ложь;
		ИскПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ВыбПоле);
		Если ИскПоле <> Неопределено И Строка(ИскПоле.ТипЗначения) = "Значения свойств объектов" Тогда
			ПараметрРевизит = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Свойство" + Сред(ВыбПоле, 14));
			ПараметрРевизит = ?(ПараметрРевизит <> Неопределено, ПараметрРевизит.Значение, Неопределено);
			Параметр = Новый Структура("Владелец", ПараметрРевизит);
			ПараметрОтбор = Новый Структура("Отбор", Параметр);
		   	ВыбЗначение = Неопределено;
			ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.Форма.ФормаВыбора" , ПараметрОтбор,,,,, Новый ОписаниеОповещения("ОткрытьФормуВыбораРеквизитаЗавершение", ЭтотОбъект, Новый Структура("ВыбПоле", ВыбПоле)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
			
		КонецЕсли;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораРеквизитаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыбПоле = ДополнительныеПараметры.ВыбПоле;
	
	
	ВыбЗначение = Результат;
	
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ВыбПоле И ВыбЗначение <> Неопределено Тогда						
			ЭлементОтбора.ПравоеЗначение = ВыбЗначение;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти
